export const regions = [
    { id: 1, name: '서울' },
    { id: 2, name: '인천' },
    { id: 3, name: '경기' },
    { id: 4, name: '부산' },
    { id: 5, name: '대구' },
    { id: 6, name: '광주' },
    { id: 7, name: '대전' },
    { id: 8, name: '울산' },
    { id: 9, name: '세종' },
    { id: 10, name: '강원' },
    { id: 11, name: '충북' },
    { id: 12, name: '충남' },
    { id: 13, name: '전북' },
    { id: 14, name: '전남' },
    { id: 15, name: '경북' },
    { id: 16, name: '경남' },
    { id: 17, name: '제주' }
];

export const cities = {
    1: ['강남구', '강동구', '강북구', '강서구', '관악구', '광진구', '구로구', '금천구', '노원구', '도봉구', '동대문구', '동작구', '마포구', '서대문구', '서초구', '성동구', '성북구', '송파구', '양천구', '영등포구', '용산구', '은평구', '종로구', '중구', '중랑구'],
    2: ['강화군', '계양구', '남동구', '중구', '동구', '미추홀구', '부평구', '서구', '연수구', '옹진군'],
    3: ['가평군', '고양시', '과천시', '광명시', '광주시', '구리시', '군포시', '김포시', '남양주시', '동두천시', '부천시', '성남시', '수원시', '시흥시', '안산시', '안성시', '안양시', '양주시', '양평군', '여주시', '연천군', '오산시', '용인시', '의왕시', '의정부시', '이천시', '파주시', '평택시', '포천시', '하남시', '화성시'],
    4: ['강서구', '금정구', '기장군', '남구', '동구', '동래구', '부산진구', '북구', '사상구', '사하구', '서구', '수영구', '연제구', '영도구', '중구', '해운대구'],
    5: ['남구', '달서구', '달성군', '동구', '북구', '서구', '수성구', '중구', '군위군'],
    6: ['광산구', '남구', '동구', '북구', '서구'],
    7: ['동구', '중구', '서구', '유성구', '대덕구'],
    8: ['남구', '동구', '북구', '울주군', '중구'],
    9: [], // 세종특별자치시는 구/군 구분이 없습니다.
    10: ['강릉시', '고성군', '동해시', '삼척시', '속초시', '양구군', '양양군', '영월군', '원주시', '인제군', '정선군', '철원군', '춘천시', '태백시', '평창군', '홍천군', '화천군', '횡성군'],
    11: ['제천시', '청주시', '충주시', '진천군', '음성군', '단양군', '증평군', '괴산군', '옥천군', '영동군', '보은군'],
    12: ['천안시', '공주시', '보령시', '아산시', '서산시', '논산시', '계룡시', '당진시', '금산군', '부여군', '서천군', '청양군', '홍성군', '예산군', '태안군'],
    13: ['전주시', '군산시', '익산시', '정읍시', '남원시', '김제시', '완주군', '진안군', '무주군', '장수군', '임실군', '순창군', '고창군', '부안군'],
    14: ['목포시', '여수시', '순천시', '나주시', '광양시', '담양군', '곡성군', '구례군', '고흥군', '보성군', '화순군', '장흥군', '강진군', '해남군', '영암군', '무안군', '함평군', '영광군', '장성군', '완도군', '진도군', '신안군'],
    15: ['경산시', '경주시', '고령군', '구미시', '김천시', '문경시', '봉화군', '상주시', '성주군', '안동시', '영덕군', '영양군', '영주시', '영천시', '예천군', '울릉군', '울진군', '의성군', '청도군', '청송군', '칠곡군', '포항시'],
    16: ['거제시', '거창군', '고성군', '김해시', '남해군', '밀양시', '사천시', '산청군', '양산시', '의령군', '진주시', '창녕군', '창원시', '통영시', '하동군', '함안군', '함양군', '합천군'],
    17: ['서귀포시', '제주시'],
};

export const categories = ['누수', '방수', '하수구', '리모델링', '동파/해빙', '수도설비', '기타'];

export const equipmentGroups = [
    {
        name: '누수 장비',
        options: ['청음식탐지기', '가스식탐지기', '디지털압력계', '열화상카메라', '상관식탐지기', '수분측정기']
    },
    {
        name: '하수구 장비',
        options: ['관통기', '배관석션기', '플렉스샤프트', '배관내시경', '관로탐지기', '고압세척기']
    }
];

export const API_BASE_URL = 'https://vu7bkzs3p7.execute-api.ap-northeast-2.amazonaws.com';

export const KAKAO_APP_KEY = 'd3e6def7639d07ad73bea46535bffed4';